<template>
  <v-content>
    <v-container>
      <h2>プライバシーポリシー</h2>
      ブロックベース株式会社（以下、「当社」といいます。）は、以下のとおり個人情報保護方針を定め、個人情報の保護を推進致します。本ポリシーに用いられる用語は、利用規約に準じるものとします。
      <h3>第1条（総則）</h3>
      当社は、利用者のプライバシーを尊重し、利用者の個人情報の管理に細心の注意を払うものとします。
      当社は、利用者の個人情報を保護するための施策の実施・維持、それらの継続的な改善を行います。当社は、個人情報保護に関する法令及びその他の規範を遵守します。
      <h3>第2条（個人情報の利用目的）</h3>
      当社は、利用者から収集した個人情報を以下の目的のために使用するものとします。 (1)
      利用者からのお問い合わせ・ご相談に対する回答・返信をするため (2) 利用者に対し、サービスをご案内するため (3)
      サービス改善を目的とした分析を行うため (4) バックアップデータ作成のため (5)
      本規約に違反する行為又はその恐れのある行為を行った利用者に対して注意又は警告等の対応を行うため (6)
      当社内の監査実施のため (7) その他上記目的に付随する業務のため
      <h3>第3条（個人情報等の管理）</h3>
      当社は、個人情報保護法に基づき、個人情報を厳重に管理し機密保持に努めるものとします。当社は、外部からの攻撃及び侵入の脅威から個人情報を保護するため、ファイアーウォールやSSLの技術をはじめとする業界標準の技術を用い、第三者の不正アクセスを防止するために最大限の措置を採るものとします。
      <h3>第4条（個人情報の第三者提供）</h3>
      当社は、収集した個人情報を、無断で第三者に対して開示又は提供しないものとします。
      ただし、個人情報保護法上の例外にあたる場合はこの限りではありません。
      <h3>第5条（個人情報管理の委託）</h3>
      当社は、利用目的の達成に必要な範囲内において、個人情報を当社のプライバシーポリシーに従う委託先の管理下に置くことがあります。
      <h3>第6条（共同利用）</h3>
      当社は、以下のとおり、特定の者との間で個人情報を共同利用する場合があります。
      (1)当社の代理で、支払処理、データ分析、メール送信、ホスティングサービス,カスタマーサービスなどを行うサービスを提供する第三者
      (2)当社のマーケティングについてサポートを行うサービスを提供する第三者
      (3)Facebook、Twitterその他の外部サービスを運営する会社 (4)第三者広告主
      <h3>第7条（個人情報の最新性・正確性の維持）</h3>
      当社は、利用目的の達成に必要な範囲内において、利用者の個人情報を正確かつ最新の内容に保つよう努めるものとします。
      <h3>第8条（データのバックアップ）</h3>
      弊社が運営するサービスは定期的に情報のバックアップデータを保存することがあります。これらのデータには、本サービスの利用により取得した個人情報が含まれる場合があります。これらの情報は、利用者がその地位を喪失した後においても保存される場合があります。ただし、当社は、それらの情報を保存する義務を負うものではなく、保存された情報が再度利用可能になることを保証するものでもありません。
      <h3>第9条（利用者による開示請求手続）</h3>
      当社は、利用者より当該利用者の個人情報の開示を求められた場合、利用者ご本人様からの請求であることを確認した後、個人情報保護法上の例外に当たらない場合には、利用者に対し、合理的期間内に開示を行います。なお、メンバーにつきましては、メンバー情報管理画面より当社が保有する個人情報を確認及び訂正することができます。
      <h3>10条（免責）</h3>
      当社は、外部からの攻撃及び侵入の脅威から個人情報を保護するための最大限の措置を講じますが、個人情報は、常に外部からの攻撃と侵入の脅威に晒されています。当社は、これらの保護措置の有効性及び不法な第三者からの不正アクセス防止を保証するものではありません。当社、当社の役職員及び委託先等の関係者は、当社の合理的措置にもかかわらず発生した個人情報漏えいによる損害については、一切の責任を負いません。
    </v-container>
  </v-content>
</template>
