<template>
<v-content>
    <v-container>
        <v-card-text color="teal">
        <br>
        <div class="display-1 text-md-center">bazaaar(バザー)サービス利用規約</div>
        <br>
        <p>この規約は、お客様が、BlockBase株式会社（以下「当社」）が提供する「bazaaar(バザー)」サービス（以下「本サービス」）をご利用頂く際の取扱いにつき定めるものです。本規約に同意した上で本サービスをご利用ください。</p>

        <div class="display-1 pt-4">第1条（定義）</div>
        <p>本規約上で使用する用語の定義は、次に掲げるとおりとします。</p>
        <v-data-table
            :headers="headers"
            :items="definitions"
            hide-actions
            class="elevation-1"
        >
            <template slot="items" slot-scope="props">
            <td>{{ props.item.name }}</td>
            <td>{{ props.item.definition }}</td>
            </template>
        </v-data-table>

        <div class="display-1 pt-4">第2条 (事前の同意)</div>
        <div class="body-1">
        <p>利用者は、本サービスを利用するに当たって、以下の事項について予め同意したこととします。</p>
        <ol>
            <li>本サービスはベータ版・開発中のものであり、その性質上、バグや瑕疵、誤動作など、正常に利用できない症状等の不具合を含み得るものとして提供されるものであること。</li>
            <li>当社は、利用者に対し、本サービスの正確性・完全性・有用性・信頼性・無害性等に関していかなる保証もするものではないこと。</li>
        </ol>
        </div>

        <div class="display-1 pt-4">第3条（本規約への同意）</div>
        <ol>
        <li>利用者は、本利用規約に同意頂いた上で、本サービスを利用できるものとします。</li>
        <li>利用者が、本サービスをウェブブラウザを介し、本サービスを利用した時点で、利用者と当社との間で、本規約の諸規定に従った利用契約が成立するものとします。</li>
        <li>利用者が未成年者である場合には、親権者その他の法定代理人の同意を得たうえで、本サービスをご利用ください。</li>
        <li>未成年者の利用者が、法定代理人の同意がないにもかかわらず同意があると偽りまたは年齢について成年と偽って本サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、本サービスに関する一切の法律行為を取り消すことは出来ません。</li>
        <li>本規約の同意時に未成年であった利用者が成年に達した後に本サービスを利用した場合、当該利用者は本サービスに関する一切の法律行為を追認したものとみなされます。</li>
        </ol>

        <div class="display-1 pt-4">第4条（規約の変更）</div>
        <ol>
        <li>当社は、利用者の承諾を得ることなく、いつでも、本規約の内容を改定することができるものとし、利用者はこれを異議なく承諾するものとします。</li>
        <li>当社は、本規約を改定するときは、その内容について当社所定の方法により利用者に通知します。</li>
        <li>前本規約の改定の効力は、当社が前項により通知を行った時点から生じるものとします。</li>
        <li>利用者は、本規約変更後、本サービスを利用した時点で、変更後の本利用規約に異議なく同意したものとみなされます。</li>
        </ol>

        <div class="display-1 pt-4">第5条（アカウントの管理）</div>
        <ol>
            <li>利用者は、利用に際して登録した情報（以下「登録情報」。メールアドレスやID・パスワード等を含みます）について、自己の責任の下、任意に登録、管理するものとします。利用者は、これを第三者に利用させ、または貸与、譲渡、名義変更、売買などをしてはならないものとします。</li>
            <li>当社は、登録情報によって本サービスの利用があった場合、利用登録をおこなった本人が利用したものと扱うことができ、当該利用によって生じた結果ならびにそれに伴う一切の責任については、利用登録を行った本人に帰属するものとします。</li>
            <li>利用者は、登録情報の不正使用によって当社または第三者に損害が生じた場合、当社および第三者に対して、当該損害を賠償するものとします。</li>
            <li>登録情報の管理は、利用者が自己の責任の下で行うものとし、登録情報が不正確または虚偽であったために利用者が被った一切の不利益および損害に関して、当社は責任を負わないものとします。</li>
            <li>登録情報が盗用されまたは第三者に利用されていることが判明した場合、利用者は直ちにその旨を当社に通知するとともに、当社からの指示に従うものとします。</li>
        </ol>

        <div class="display-1 pt-4">第6条（ウォレット）</div>
        <ol>
            <li>利用者は、本サービスをウェブブラウザ経由で利用する場合、当社の指定するブラウザ及びデジタル・アセット及び暗号通貨の保管機能（以下「ウォレット」）を利用するものとします。</li>
            <li>利用者は、本サービスをウェブブラウザ経由で利用する場合、同端末中のウォレット機能その他当社の指定するウォレットを利用するものとします。</li>
            <li>ウォレットの管理は、利用者自身の端末機器上の記憶領域を利用して行われます。当社は、オンライン上での管理手段を提供しません。ウォレットへの入金及びウォレットからの出金は、当社所定の時期及び方法により行われるものとします。</li>
        </ol>

        <div class="display-1 pt-4">第7条（手数料について）</div>
        <p>本サービスの利用には、当Webサイト内に明示する当社所定の手数料がかかります。手数料は当社の判断で変更できるものとし、ユーザーは予めこれを承諾するものとします。</p>

        <div class="display-1 pt-4">第8条（アカウント等の管理）</div>
        <ol>
            <li>利用者は、自身の端末機器、アカウント、秘密鍵及びパスワード（以下「アカウント等」。）を第三者に使用させ、又は第三者と共有してはならないものとします。当社は、利用者の端末機器及び秘密鍵を一切管理しません。</li>
            <li>利用者は、本サービスの利用にあたり、自身のアカウント等を自らの責任において管理するものとし、自身のアカウント等を使用してなされた行為について、一切の責任を負うものとします。</li>
            <li>当社は、利用者自身のアカウント又は秘密鍵を使用してなされた行為について、その実際の利用者が誰であるかを問わず、すべて、当該アカウントが付与され又は当該秘密鍵を管理する利用者による行為とみなします。</li>
            <li>当社は、利用者の使用する端末機器の故障、紛失、第三者からのマルウェア、スパイウェア、ウィルス、ハッキング・クラッキング等による攻撃、アカウント等の管理不備及び使用上の過誤、又は第三者によるアカウント等の使用等により、利用者がウォレット内の暗号通貨やデジタル・アセットの喪失、使用不能を含む損害を蒙った場合であっても、当社に故意又は重過失ある場合を除き、一切の責任を負いません。</li>
            <li>利用者は、自身のアカウント等が第三者により不正に利用されるおそれがある場合、速やかに当社に通知するとともに、当該の不正な利用を回避するための必要な措置をとるものとします。</li>
            <li>当社は、利用者が自身のアカウント等を紛失又は失念したことにより、利用者に生じうる不利益（ウォレット内の暗号通貨その他本サービスにおいて実現される一切の状態（以下「利用データ等」とします。）及び本サービスに関連するブロックチェーン上の情報が失われることを含みます。）について、一切の責任を負いません。</li>
            <li>利用者は、利用者の端末機器、秘密鍵及びパスワードのいずれか一つでも欠けた場合、利用者はウォレットを使用することが不可能となること、並びに、当社が当該ウォレットに関して何らかの救済を行うことが不可能であることを予め了解するものとします。</li>
        </ol>

        <div class="display-1 pt-4">第9条（有償サービス）</div>
        <ol>
            <li>当社は、利用者に対し、本サービスにおいて、有償のサービスを提供することがあります。当社は有償サービスの一部として、利用者間の行為について手数料その他の費用を定めることがあります。</li>
            <li>利用者は、当社が定める価格及び決済手段によってのみ、当社に対し、有償サービスの購入及び支払いをすることができます。</li>
            <li>利用者と当社以外の第三者との間で、支払いに関する紛争が生じた場合、利用者は当該第三者との間でその解決を図るものとし、当社は、当社に故意又は重過失ある場合を除き、一切の責任を負いません。</li>
            <li>当社は、利用者が購入した有償サービスおよび有償データを、当社が別途定める場合、又は法令上必要がある場合を除き払い戻しません。</li>
        </ol>

        <div class="display-1 pt-4">第10条（費用の負担）</div>
        <p>本サービスの利用にあたり必要なソフトウェアの購入の費用、データの利用料金等の通信料金、電気料金その他一切の費用は、利用者が自己の責任において支払うものとします。</p>

        <div class="display-1 pt-4">第11条（デジタル・アセット）</div>
        <ol>
            <li>本サービスにおいて「デジタル・アセット」とは、利用者が本サービス上で保有可能な情報であり、本サービス上で定義されるものを指します。</li>
            <li>利用者は、デジタル・アセットを他の利用者に対し、当社が定める方法により譲渡することができます。</li>
        </ol>

        <div class="display-1 pt-4">第12条（個人情報等の取り扱い）</div>
        <p>個人情報及び利用者情報については、当社が別途定める<a :href="'/privacy'">「プライバシーポリシー」</a>に則り、適正に取り扱うこととします。</p>

        <div class="display-1 pt-4">第13条（禁止行為）</div>
        <p>本サービスの利用に際し、当社は、利用者に対し、次に掲げる行為を禁止します。当社において、利用者が禁止事項に違反したと認めた場合、利用停止、投稿削除等、当社において必要と判断した措置を取ることができるものとし、利用者はこれを異議なく同意するものとします。</p>
        <ol>
            <li>当社または第三者の知的財産権を侵害する行為</li>
            <li>当社または第三者の名誉・信用を毀損または不当に差別もしくは誹謗中傷する行為</li>
            <li>当社または第三者の財産を侵害する行為、または侵害する恐れのある行為</li>
            <li>当社または第三者に経済的損害を与える行為</li>
            <li>当社または第三者に対する脅迫的な行為</li>
            <li>利用者が、以下の情報を投稿すること</li>
                <p>①第三者の権利および財産に対して損害を与えるリスクのある情報</p>
                <p>②第三者に対して有害な情報、第三者を身体的・心理的に傷つける情報</p>
                <p>③犯罪や不法行為、危険行為に属する情報およびそれらを教唆、幇助する情報</p>
                <p>④不法、有害、脅迫、虐待、人種差別、中傷、名誉棄損、侮辱、ハラスメント、扇動、不快を与えることを意図し、もしくはそのような結果を生じさせる恐れのある内容をもつ情報</p>
                <p>⑤事実に反する、または存在しないと分かっている情報</p>
                <p>⑥利用者自身がコントロール可能な権利を持たない情報</p>
                <p>⑦第三者の著作権を含む知的財産権やその他の財産権を侵害する情報、公共の利益または個人の権利を侵害する情報</p>
                <p>⑧わいせつ、児童ポルノまたは児童虐待にあたる画像、文書等の情報</p>
                <p>⑨医師法などの法令に違反する情報</p>
                <p>⑩その他当社が不適切と判断する情報</p>
            <li>コンピューターウィルス、有害なプログラムを仕様またはそれを誘発する行為</li>
            <li>本サービス用インフラ設備に対して過度な負担となるストレスをかける行為</li>
            <li>当サイトのサーバーやシステム、セキュリティへの攻撃</li>
            <li>当社提供のインターフェース以外の方法で当社サービスにアクセスを試みる行為</li>
            <li>一人の利用者が、複数の利用者IDを取得する行為</li>
            <li>上記の他、当社が不適切と判断する行為</li>
        </ol>

        <div class="display-1 pt-4">第14条 （コンテンツの取り扱い）</div>
        <ol>
            <li>利用者は､本サービスのコンテンツを当社の定める範囲内でのみ使用することができるものとします｡</li>
            <li>本サービスで提供される全てのコンテンツに関する権利は当社が有しており､利用者に対し､当社が有する特許権､実用新案権､ 意匠権､商標権､著作権､その他知的財産権の実施または使用許諾をするものではありません｡</li>
            <li>利用者は､当社の定める使用範囲を超えていかなる方法によっても複製､送信､譲渡（利用者同士の売買も含みます）､貸与､翻訳､翻案、無断で転載、二次使用、営利目的の使用、改変、逆アセンブル、逆コンパイル、リバースエンジニアリング等を行う事を禁止します。</li>
            <li>前項に関わらず､退会等により利用者が利用者資格を喪失した場合は､提供されたコンテンツの使用権も消滅するものとします｡</li>
            <li>利用者が、本サービス上に投稿その他の方法で送信したコンテンツ（静止画、動画、文字情報その他一切の情報）に関する著作権（著作権法第21条ないし同第28条に規定する権利を含む全ての著作権を含む。）については利用者に帰属するものとします。ただし、利用者は、コンテンツの送信時に、当社に対し、日本国内外において、当該コンテンツを無償かつ非独占的に使用することを許諾します。</li>
            <li>利用者は本サービス内では、著作者人格権を行使しないものとします。</li>
        </ol>

        <div class="display-1 pt-4">第15条（免責）</div>
        <ol>
            <li>当社は、本サービスの内容変更、中断、終了によって生じたいかなる損害についても、一切責任を負いません。</li>
            <li>当社は、利用者の本サービスの利用環境について一切関与せず、また一切の責任を負いません。</li>
            <li>当社は、本サービスが利用者の特定の目的に適合すること、期待する機能・商品的価値・正確性・有用性を有すること、利用者による本サービスの利用が利用者に適用のある法令または業界団体の内部規則等に適合すること、および不具合が生じないことについて、何ら保証するものではありません。</li>
            <li>当社は、本サービスが全ての情報端末に対応していることを保証するものではなく、本サービスの利用に供する情報端末のOSのバージョンアップ等に伴い、本サービスの動作に不具合が生じる可能性があることにつき、利用者は予め了承するものとします。当社は、かかる不具合が生じた場合に当社が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。<li>
            <li>利用者は、AppStore、GooglePlay等のサービスストアなどの利用規約および運用方針の変更等に伴い、本サービスの一部又は全部の利用が制限される可能性があることを予め了承するものとします。</li>
            <li>当社は、本サービスを利用したことにより直接的または間接的に利用者に発生した損害について、一切賠償責任を負いません。</li>
            <li>当社は、利用者その他の第三者に発生した機会逸失、業務の中断その他いかなる損害（間接損害や逸失利益を含みます）に対して、当社が係る損害の可能性を事前に通知されていたとしても、一切の責任を負いません。</li>
            <li>他の利用者または第三者から投稿についての削除依頼があった時、当社の判断で削除の可否を決定できるものとし、当該判断により生じた一切の責任について、当社は責任を負わないものとします。</li>
            <li>第１項乃至前項の規定は、当社に故意または重過失が存する場合又は契約書が消費者契約法上の消費者に該当する場合には適用しません。</li>
            <li>前項が適用される場合であっても、当社は、過失による行為によって利用者に生じた損害のうち、特別な事情から生じた損害については、一切賠償する責任を負わないものとします。</li>
            <li>本サービスの利用に関し当社が損害賠償責任を負う場合、当該損害が発生した月に利用者から受領した利用額を限度として賠償責任を負うものとします。</li>
            <li>利用者と他の利用者との間の紛争及びトラブルについて、当社は一切責任を負わないものとします。利用者と他の利用者でトラブルになった場合でも、両者同士の責任で解決するものとし、当社には一切の請求をしないものとします。</li>
            <li>利用者は、本サービスの利用に関連し、他の利用者に損害を与えた場合または第三者との間に紛争を生じた場合、自己の費用と責任において、かかる損害を賠償またはかかる紛争を解決するものとし、当社には一切の迷惑や損害を与えないものとします。</li>
            <li>利用者の行為により、第三者から当社が損害賠償等の請求をされた場合には、利用者の費用（弁護士費用）と責任で、これを解決するものとします。当社が、当該第三者に対して、損害賠償金を支払った場合には、利用者は、当社に対して当該損害賠償金を含む一切の費用（弁護士費用及び逸失利益を含む）を支払うものとします。</li>
            <li>利用者が本サービスの利用に関連して当社に損害を与えた場合、利用者の費用と責任において当社に対して損害を賠償（訴訟費用及び弁護士費用を含む）するものとします。</li>
            <li>本サービスで他の利用者が投稿した情報の正確性について、当社は保証しません。当社は、本サービスに掲載されている情報についての紛争及びトラブルについて一切の責任を負いません。</li>
        </ol>

        <div class="display-1 pt-4">第16条（広告の掲載について）</div>
        <p>利用者は、本サービス上にあらゆる広告が含まれる場合があること、当社またはその提携先があらゆる広告を掲載する場合があることを理解しこれを承諾したものとみなします。本サービス上の広告の形態や範囲は、当社によって随時変更されます。</p>

        <div class="display-1 pt-4">第17条（権利譲渡の禁止）</div>
        <ol>
            <li>利用者は、予め当社の書面による承諾がない限り、本規約上の地位および本規約に基づく権利または義務の全部または一部を第三者に譲渡してはならないものとします。</li>
            <li>当社は、本サービスの全部または一部を当社の裁量により第三者に譲渡することができ、その場合、譲渡された権利の範囲内で利用者のアカウントを含む、本サービスに係る利用者の一切の権利が譲渡先に移転するものとします。</li>
        </ol>

        <div class="display-1 pt-4">第18条（分離可能性）</div>
        <p>本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、本規約の残りの規定及び一部が無効又は執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。</p>

        <div class="display-1 pt-4">第19条（当社への連絡方法）</div>
        <p>本サービスに関する利用者の当社へのご連絡・お問い合わせは、本サービスまたは当社が運営するWebサイト内の適宜の場所に設置するお問い合わせフォームからの送信または当社が別途指定する方法により行うものとします。</p>

        <div class="display-1 pt-4">第20条（準拠法、管轄裁判所）</div>
        <ol>
            <li>本規約の有効性，解釈及び履行については，日本法に準拠し，日本法に従って解釈されるものとする。</li>
            <li>当社と利用者等との間での論議・訴訟その他一切の紛争については、訴額に応じて、東京簡易裁判所又は東京地方裁判所を専属的合意管轄裁判所とします｡</li>
        </ol>

        <p>2019年2月1日　施行</p>

    </v-card-text>
    </v-container>
  </v-content>
</template>

<script>
export default {
     data () {
      return {
        headers: [
          {
            text: '用語',
            align: 'left',
            sortable: false,
            value: 'name',
            width: '20%'
          },
          {
            text: '定義',
            value: 'definition',
            sortable: false,
          },
        ],
        definitions: [
          {
            name: '（1）本サービス',
            definition: '当社が運営するサービス及び関連するサービス',
          },
          {
            name: '（2）本サイト',
            definition: '本サービスのコンテンツが掲載されたウェブサイト',
          },
          {
            name: '（3）本コンテンツ',
            definition: '本サービス上で提供される文字、音、静止画、動画、ソフトウェアプログラム、コード等の総称（投稿情報を含む）',
          },
          {
            name: '（4）利用者',
            definition: '本サービスを利用する全ての方',
          },
          {
            name: '（5）登録利用者',
            definition: '本サイトの利用者登録が完了した方',
          },
          {
            name: '（6）ID',
            definition: '本サービスの利用のために登録利用者が固有に持つ文字列',
          },
          {
            name: '（7）パスワード',
            definition: 'IDに対応して登録利用者が固有に設定する暗号',
          },
          {
            name: '（8）投稿',
            definition: '登録利用者が文章、文字列、画像、コメント等を掲載する行為',
          },
          {
            name: '（9）投稿情報',
            definition: '登録利用者が投稿等により掲載した文章、文字列、画像、コメント等の情報の総称',
          },
          {
            name: '（10）知的財産',
            definition: '発明、考案、植物の新品種、意匠、著作物その他の人間の創造的活動により生み出されるもの（発見または解明がされた自然の法則または現象であって、産業上の利用可能性があるものを含む）、商標、商号その他事業活動に用いられる商品または役務を表示するもの及び営業秘密その他の事業活動に有用な技術上または営業上の情報',
          },
          {
            name: '（11）知的財産権',
            definition: '特許権、実用新案権、育成者権、意匠権、著作権、商標権その他の知的財産に関して法令により定められた権利または法律上保護される利益に係る権利',
          },
        ]
      }
    }

}
</script>

<style>

</style>
